# A問題

x = int(input())

if x == 1:
    print(0)
else:
    print(1)

#----------------------------------------------------
# B問題
a, b, c, d = map(int, input().split())

# 正ｘ正、負ｘ負の大きい方
if (b >= 0 and d >= 0) or (a < 0 and c < 0):
    print(max(b * d, a * c))
# 正ｘ負、正ｘ負の大きい方
else:
    print(max(a * d, b * c))

#-----------------------------------------------------
# C問題

n = int(input())

# n=1のとき、条件を満たすものは存在しない
if n==1:
    print(0)
# ベン図を使用した解法
# 全体 - (0無しの数列 + 9無しの数列 -　0,9両方無しの数列) = 0と9が共に存在する数列
else:
    print(((10**n)+(8**n)-(2*(9**n)))%((10**9)+7))
